/* XTIT: Info Screen text when applying the NUIStyleSheet. */
"applyNUIStyleSheetApplyStepInfoScreenText" = "NUIStyleSheet alkalmazása.";

/* XTIT: Info Screen text when applying the SAP Mobile Services LogSettings. */
"applySAPcpmsLogSettingsStepInfoScreenText" = "SAP Mobile Services LogSettings alkalmazása.";

/* XFLD: Text information if the provided credentials were invalid. */
"authenticationFailedMessage" = "A hitelesítés nem sikerült.";

/* XTIT: Info Screen text before presenting the Basic Authentication view. */
"basicAuthenticationStepInfoScreenText" = "A bejelentkezési adatok ellenőrzése.";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the onboarding flow. */
"cancelAlertControllerTitleText" = "Valóban szeretné megszakítani az előkészítési folyamatot?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the restore flow. */
"cancelRestoreAlertControllerTitleText" = "Valóban szeretné megszakítani a visszaállítási folyamatot?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the reset passcode flow. */
"cancelResetPasscodeAlertControllerTitleText" = "Valóban szeretné megszakítani a jelkód-visszaállítási folyamatot?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the authentication process. */
"cancelAuthenticationProcessAlertControllerTitleText" = "Valóban szeretné megszakítani a hitelesítési folyamatot?";

/* Title of Alert window when asking for confirmation about triggering the reset passcode flow. */
"resetPasscodeAlertControllerTitleText" = "Valóban szeretné visszaállítani a jelkódot?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the passcode change flow. */
"cancelPasscodeChangeControllerTitleText" = "Valóban szeretné megszakítani a jelkód módosítási folyamatát?";

/* XTIT: Title of Alert window when asking for confirmation about reset the application. */
"cancelPasscodeControllerTitleText" = "Valóban szeretné visszaállítani az alkalmazást?";

/* XTIT: Info Screen text when running the Composite Steps. */
"compositeStepInfoScreenText" = "Összetett lépések.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services ClientResources. */
"downloadSAPcpmsClientResourcesStepInfoScreenText" = "SAP Mobile Services ClientResources letöltése.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services Destinations. */
"downloadSAPcpmsDestinationsStepInfoScreenText" = "SAP Mobile Services célok letöltése.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services Settings. */
"downloadSAPcpmsSettingsStepInfoScreenText" = "SAP Mobile Services beállítások letöltése.";

/* XBUT: Text of button on FUIFeedbackScreen when the Face ID got disabled by passcode policy. */
"fuiFeedbackDisableFaceIDButtonText" = "Folytatás";

/* XBUT: Text of button on FUIFeedbackScreen when the Touch ID is disabled by the new passcode policy */
"fuiFeedbackDisableTouchIDButtonText" = "Folytatás";

/* XBUT: Text of button on FUIFeedbackScreen when the Face ID is enabled by the new passcode policy */
"fuiFeedbackEnableFaceIDButtonText" = "Aktiválás";

/* XBUT: Text of button on FUIFeedbackScreen when the Touch ID is enabled by the new passcode policy */
"fuiFeedbackEnableTouchIDButtonText" = "Aktiválás";

/* XTIT: FUIFeedbackScreen headline description text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDDetailDescription" = "Kérjük, használjon jelkódot a következő bejelentkezéshez.";

/* XTIT: FUIFeedbackScreen headline text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDHeadlineDescription" = "A Face ID a továbbiakban nem lesz elérhető";

/* XTIT: FUIFeedbackScreen title text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDTitleText" = "Szabályzatmódosítások";

/* XTIT: FUIFeedbackScreen headline description text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDDetailDescription" = "Kérjük, használjon jelkódot a következő bejelentkezéshez.";

/* XTIT: FUIFeedbackScreen headline text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDHeadlineDescription" = "A Touch ID a továbbiakban nem lesz elérhető";

/* XTIT: FUIFeedbackScreen title text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDTitleText" = "Szabályzatmódosítások";

/* XTIT: FUIFeedbackScreen detail description text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenEnableFaceIDDetailDescription" = "A funkció bármikor be- és kikapcsolható a Beállításokban.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy changed and face ID is enabled. */
"fuiFeedbackScreenEnableFaceIDHeadlineDescription" = "Mostantól elérhető a Face ID! A Face ID aktiválása lehetővé teszi, hogy gyorsabban férjen hozzá az adataihoz.";

/* XTIT: FUIFeedbackScreen title text when Face ID is enabled in the new passcode policy. */
"fuiFeedbackScreenEnableFaceIDTitleText" = "Face ID";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenEnableTouchIDDetailDescription" = "A funkció bármikor be- és kikapcsolható a Beállításokban.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy changed and touch ID is enabled. */
"fuiFeedbackScreenEnableTouchIDHeadlineDescription" = "Mostantól elérhető a Touch ID! A Touch ID aktiválása lehetővé teszi, hogy gyorsabban férjen hozzá az adataihoz.";

/* XTIT: FUIFeedbackScreen title text when touchID is enabled by the new passcode policy. */
"fuiFeedbackScreenEnableTouchIDTitleText" = "Touch ID";

/* XBUT: Text of button on FUIFeedbackScreen when passcode change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedActionButtonText" = "Folytatás";

/* XMSG: FUIFeedbackScreen description when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedDescriptionLabel" = "Kérjük, hozzon létre új jelkódot.";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedHeadlineText" = "Módosult a jelszószabályzat";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedTitleText" = "Szabályzatmódosítások";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeAndFaceIDDetailDescription" = "Mostantól kezdve a jelkód és a Face ID nem szükséges a bejelentkezéshez. \n\n Közvetlenül be tud lépni az alkalmazásba.";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeAndTouchIDDetailDescription" = "Mostantól kezdve a jelkód és a Touch ID nem szükséges a bejelentkezéshez. \n\n Közvetlenül be tud lépni az alkalmazásba.";

/* XBUT: Text of button on FUIFeedbackScreen when the passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeButtonText" = "OK";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeDetailDescription" = "Mostantól kezdve a jelkód nem szükséges a bejelentkezéshez. \n\n Közvetlenül be tud lépni az alkalmazásba.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeHeadlineDescription" = "Módosult a bejelentkezési szabályzat";

/* XTIT: FUIFeedbackScreen title text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeTitleText" = "Megjegyzés";

/* XBUT: Text of button on FUIFeedbackScreen after migration when passcode creation is mandatory. */
"migrationOnlyBiometricIDWasSetPreviouslyButtonText" = "Folytatás";

/* XTIT: Description of FUIFeedbackScreen after migration when previously only biometricID was set. */
"migrationOnlyBiometricIDWasSetPreviouslyDescriptionText" = "Ettől a verziótól kezdve kötelező a jelkód. Kérjük, hozzon létre jelkódot az alkalmazáshoz.";

/* XTIT: Title of FUIFeedbackScreen after migration when previously only biometricID was set. */
"migrationOnlyBiometricIDWasSetPreviouslyHeadlineText" = "A jelkód kötelező";

/* XBUT: Text of No button. */
"noButtonText" = "Nem";

/* XTIT: Info Screen text before presenting the OAuth2 Authentication view. */
"oauth2AuthenticationStepInfoScreenText" = "OAuth 2.0 bejelentkezési adatok ellenőrzése.";

/* XTIT: Text of PasscodeInputController when user wants to enable face ID. */
"passcodeInputControllerEnableFaceIDText" = "A Face ID aktiválásához adja meg a jelkódot:";

/* XTIT: Text of PasscodeInputController when user wants to enable touch ID. */
"passcodeInputControllerEnableTouchIDText" = "A Touch ID aktiválásához adja meg a jelkódot:";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the onboarding flow. */
"rejectAlertControllerTitleText" = "Hozzájárulás nélkül nem tudja folytatni az előkészítést.";

/* XBUT: Text of No button of reject. */
"rejectNoButtonText" = "Hozzájárulás megadása";

/* XBUT: Text of Yes button of reject. */
"rejectYesButtonText" = "Kilépés a folyamatból";

/* XTIT: Info Screen text before presenting the SAML Authentication view. */
"samlAuthenticationStepInfoScreenText" = "SAML bejelentkezési adatok ellenőrzése.";

/* XTIT: Info Screen text before presenting the SAP Mobile Services UserIdentity Discovery Authentication view. */
"sapcpmsUserIdentityDiscoveryAuthenticationStepInfoScreenText" = "SAP Mobile Services UserIdentityDiscovery bejelentkezési adatainak ellenőrzése.";

/* XTIT: Info Screen text before presenting the SLS Authentication view. */
"slsAuthenticationStepInfoScreenText" = "SLS bejelentkezési adatok ellenőrzése";

/* XMSG: Message for the user to fill all the fields for authentication. */
"slsFillAllOfTheFieldsErrorMessage" = "Kérjük, töltse ki az összes mezőt";

/* XBUT: Text of Yes button. */
"yesButtonText" = "Igen";

/* XBUT: Text of Continue button. */
"continueButtonText" = "Folytatás";

/* XBUT: Text of Cancel button. */
"cancelButtonText" = "Mégse";

/* XTIT: Title of Usage Collection Consent onboarding flow. */
"UsageCollectionConsentTitle" = "Használati adatok gyűjtése";

/* XTIT: Body of Usage Collection Consent onboarding flow. */
"UsageCollectionConsentBody" = "Az alkalmazásadminisztrátor arra kéri önt, hogy engedélyezze az adatgyűjtést az alkalmazás használatáról az alkalmazás javításához szükséges betekintés nyerése céljából. Az adatgyűjtés magában foglalja az alkalmazás használatának módjával kapcsolatos információkat, például az alkalmazás használatával töltött időt és az alkalmazáson belüli navigációt.";

/* XTIT: Usage Collection Consent opt-out alert message. */
"usageOptOutAlertMessage" = "El szeretné utasítani?";

/* XTIT: Usage Collection Consent opt-in alert message. */
"usageOptInAlertMessage" = "Bele szeretne egyezni?";

/* XTIT: Title of Crash Report Collection Consent onboarding flow. */
"CrashReportCollectionConsentTitle" = "Összeomlási beszámolók gyűjtése";

/* XTIT: Body of Crash Report Collection Consent onboarding flow. */
"CrashReportCollectionConsentBody" = "Az alkalmazásadminisztrátor arra kéri önt, hogy engedélyezze az adatgyűjtést az alkalmazás-összeomlás diagnosztizálása és elemzése céljából, az alkalmazás stabilitásának javítása érdekében. A gyűjtött adatok az összeomlási beszámolókra és az eszközinformációkra korlátozódnak.";

/* XTIT: Title of alert to be shown when QR Digital Signature Verification fails. */
"qrDigitalSignatureVerficationFailedTitle" = "Sikertelen!";

/* \"XMSG: Message telling that the QR Digital Signature Verification failed.\" */
"qrDigitalSignatureVerficationFailedMessage" = "A QR-kódos aláírás ellenőrzése sikertelen!";

/* \"XMSG: Message telling that the QR code signature verification succeeded.\" */
"qrDigitalSignatureVerficationSucceededMessage" = "A QR-kódos aláírás ellenőrzése sikeres. Ön a következőhöz fog kapcsolódni:";

/* \"XTIT: Title of InfoScreenPresenter when token expires and authentication fails.\" */
"authenticationErrorTitle" = "Hitelesítési hiba";

/* \"XMSG: Message of InfoScreenPresenter when token expires and authentication fails.\" */
"authenticationErrorMessage" = "Nem tudtuk hitelesíteni önt. Kérjük, jelentkezzen be.";

/* \"XBUT: Text of Error button.\" */
"errorButtonText" = "Hiba";

